//二维数组
#include <stdio.h>

int main()
{
	//创建三行四列-三行十列
	//int arr[3][4];
	///char ch[3][10];
	//初始化-创建赋值-可以省略行不可省略列
	//int arr[3][4] = {1,2,3,4,5,6,7,8,9,10,11,12};
	//按行赋值1234-5678-9 10 11 12
	// 
	//int arr[3][4] = { 1,2,3,4,5,6,7};
	//不完全初始化，后面默认补零,字符数组补\0
	//
	//int arr[3][4] = {{1,2},{3,4},{4,5}}
	//依旧按行赋值一个括号代表一行
	//二维数组按照顺序在内存中储存
	//打印二维数组
	int arr[2][3] = { {1,2,3},{4,5,6}};
	int x = 0, y = 0;
	for (int i = 0; i < 2;i++)
	{
		for (int j = 0; j < 3; j++)
		{
			printf("%d ", arr[i][j]);
		}
		printf("\n");
	}
}