#include <stdio.h>
void main()
{
	int n = 9;
	float* p = (float*)&n;
	printf("%d\n", n);//9
	printf("%f\n", *p);//0
	*p = 9.0;
	printf("%d\n", n);
	printf("%f\n", *p);//9.0
	//浮点数和整数在内存中存储的方式是有区别的
	//浮点数的存储
	//二进制浮点数可以表示：
	//-1^S * M * 2^E
	//-1^S  表示符号位，当s=0为正数谁为负数
	//M表示有效数字大于等于1  小于2
	//M默认1存在，只存1.后面的数
	//2^E 表示指数位--储存时加上中间数127--1023
	//浮点数5.5---二进制101.1-》1.011 * 2^2
	//对于32为float-第一位为符号位-2~9存E  -剩下存M
	//对于64double 第一位 为符号位  2~12为E 剩下为 M
	//E数据当无符号数存储

	float a = 5.5f;
	//二进制=101.1
	//1.011*2^2
	//s=0,M=1.011,E=2
	//s=0,M=011,E=2+127
	//0100 0000 1011 0000 0000 0000 0000 0000 
	//40 B0 00 00
}